Repository: Phooie/MTU_portal
Catalog: locale/*/LC_MESSAGES/django.po
Languages: my

source: AI-Powered Smart MTU Website
my: AI စွမ်းပကားအသုံးပြု အဆင့်မြင့် MTU ဝက်ဘ်ဆိုဒ်

source: University Logo
my: တက္ကသိုလ်အမှတ်တံဆိပ်

source: Mandalay
my: မန္တလေး

source: Technological
my: နည်းပညာ

source: University
my: တက္ကသိုလ်

source: News & Events
my: သတင်းများ

source: Library
my: စာကြည့်တိုက်

source: Research
my: သုတေသနများ

source: Campus Life
my: ကျောင်းပရနဝုဏ်

source: Home
my: ပင်မစာမျက်နှာ

source: Departments
my: ဌာနများ

source: Contact us
my: ဆက်သွယ်ရန်

source: Admission
my: တက္ကသိုလ်ဝင်ခွင့်လျှောက်လွှာ

source: Logout
my: အကောင့်မှထွက်မည်

source: Search courses...
my: ရှာဖွေပါ

source: All Categories
my: ဘာသာရပ်အားလုံး

source: Search
my: ရှာဖွေပါ

source: No resources found.
my: ရှာဖွေလိုသောအကြောင်းအရာ မတွေ့ရှိပါ

source: Try another keyword or filter.
my: အခြားစကားလုံးအသုံးပြု၍ ပြန်ရှာကြည့်ပါ

source: Recommendations Based On Previous Courses Taken
my: လေ့လာပြီးသားဘာသာရပ်များအပေါ်အခြေခံ၍အကြံပြုချက်များ

source: About MTU
my: MTU အကြောင်း တစေ့တစောင်း

source: Contact Details
my: အသေးစိတ်ဆက်သွယ်ရန်

source: Phone
my: ဖုန်းနံပါတ်

source: Email
my: အီးမေးလ်

source: Address
my: တည်နေရာ

source: Mandalay Technological University
my: မန္တလေးနည်းပညာတက္ကသိုလ်

source: Patheingyi Township, Mandalay
my: ပုသိမ်ကြီးမြို့နယ်၊ မန္တလေးတိုင်းဒေသကြီး

source: Myanmar
my: မြန်မာ

source: Connect With Us
my: ဆက်သွယ်ရန်

source: Terms & Privacy
my: ဝန်ဆောင်မှုသတ်မှတ်ချက်များနှင့် ကိုယ်ရေးအချက်အလက်လုံခြုံရေး

source: Accessibility
my: အထွေထွေ

source: Contact
my: ဆက်သွယ်ရန်

source: Multilingual support coming soon!
my: ဘာသာစကားအမျိုးမျိုးကို မကြာမီ ထည့်သွင်းပေးမည်

source: Searching our knowledge base...
my: ကျွန်ုပ်တို့၏ အသိပညာအခြေခံစုစည်းမှုမှ ရှာဖွေနေသည်…

source: AI Workshop
my: AI အလုပ်ရုံဆွေးနွေးပွဲ

source: June 10, 2025
my: ၂၀၂၅ ဇွန်လ ၁၀ ရက်

source: July 5, 2025
my: ၂၀၂၅ ဇူလိုင် ၅ ရက်

source: Leading innovation in science and engineering
my: သိပ္ပံနှင့် အင်ဂျင်နီယာနည်းပညာအတွင်း ရှေ့ဆောင်တီထွင်မှု

source: Computer Engineering and Information Technology
my: ကွန်ပျူတာအင်ဂျင်နီယာနှင့် သတင်းအချက်အလက်နည်းပညာ

source: The CEIT Department focuses on both hardware and software systems, equipping students with the knowledge to design intelligent computing solutions.
my: ကွန်ပျူတာအင်ဂျင်နီယာနှင့်သတင်းအချက်အလက်နည်းပညာဌာနသည် Hardware နှင့် Software နှစ်မျိုးလုံးကိုအခြေခံ၍ ကျောင်းသားများအား AI နည်းပညာပုံစံများ ဖန်တီးနိုင်ရန် ကွန်ပျူတာသိပ္ပံအခြေခံ နည်းလမ်းများဖြင့် သင်ကြားပေးပါသည်။

source: Key Focus Areas
my: အထူးပြုသင်ကြားသောဘာသာရပ်များ

source: Software Development
my: Software ဖန်တီးရေးသားခြင်း

source: Cybersecurity Systems
my: ဆိုက်ဘာလုံခြုံရေးစနစ်များ

source: Databases
my: Database စနစ်များ

source: Artificial Intelligence
my: AI နည်းပညာ

source: Contact Info
my: ဆက်သွယ်ရန်

source: Head of Department
my: ဌာနမှူး

source: Civil Engineering Department
my: မြို့ပြအင်ဂျင်နီယာဌာန

source: The Civil Engineering Department trains students in planning, designing, and supervising infrastructure projects such as buildings, roads, and bridges. Emphasis is placed on structural integrity, sustainability, and environmental impact.
my: မြို့ပြအင်ဂျင်နီယာဌာနသည် အဆောက်အအုံများ၊ လမ်းများနှင့် တံတားများအပါအဝင် အခြေခံအဆောက်အအုံများကိုတည်တံ့ခိုင်မာမှု၊ တာရှည်ခံမှုနှင့် သဘာဝပတ်ဝန်းကျင်အပေါ်သက်ရောက်မှုတို့ကို အထူးအလေးပေးစီမံဆောင်ရွက်နိုင်ရန် ကျောင်းသားများကို လေ့ကျင့်သင်ကြားပေးသည်

source: Key Focus Areas:
my: အထူးပြုသင်ကြားသောဘာသာရပ်များ

source: Contact Info:
my: ဆက်သွယ်ရန်

source: Architectural Engineering Department
my: ဗိသုကာအင်ဂျင်နီယာဌာန

source: This department integrates architecture and engineering principles to produce functional, safe, and aesthetically pleasing structures. Students learn about building systems, materials, and design methods through creative and technical training.
my: ဗိသုကာအင်ဂျင်နီယာဌာနတွင် ဗိသုကာနှင့် အင်ဂျင်နီယာသဘောတရားများကို ပေါင်းစပ်အသုံးပြု၍ လှပတည်မြဲပြီး လုံခြုံသော အဆောက်အဦးများဖန်တီးနိုင်ရန်နှင့် ကျောင်းသားများအား ဖန်တီးမှုနှင့် နည်းပညာဆိုင်ရာ အတန်းများဖြင့် လေ့ကျင့်သင်ကြားပေးသည်

source: Architectural Design
my: ဗိသုကာဒီဇိုင်း

source: Building Systems
my: အဆောက်အဦးစနစ်များ

source: Urban Planning
my: မြို့ပြစီမံကိန်းရေးဆွဲမှု

source: Construction Technology
my: ဆောက်လုပ်ရေးနည်းပညာ

source: Mechanical Engineering Department
my: စက်မှုအင်ဂျင်နီယာဌာန

source: The Mechanical Engineering Department prepares students to design, analyze, and maintain mechanical systems. It covers thermodynamics, fluid mechanics, and manufacturing to address modern engineering challenges.
my: စက်မှုအင်ဂျင်နီယာဌာနတွင် စက်မှုစနစ်များကို ဒီဇိုင်းဆွဲခြင်း၊ ခွဲခြမ်းစိတ်ဖြာခြင်းနှင့် ပြုပြင်ထိန်းသိမ်းခြင်းတို့ကို လေ့ကျင့်သင်ကြားသည်။ကျောင်းသားများအား အပူဗေဒ၊ အရည်ဗေဒနှင့် ထုတ်လုပ်မှုနည်းပညာတို့ဖြင့် နောက်ဆုံးပေါ်စက်မှုပြဿနာများကို ဖြေရှင်းနိုင်စွမ်းရှိစေရန် လေ့ကျင့်သင်ကြားပေးသည်

source: Mechanical Design
my: စက်မှုဒီဇိုင်းများ

source: Manufacturing Processes
my: စက်မှုထုတ်လုပ်မှုလုပ်ငန်းစဉ်များ

source: Electrical Power Engineering Department
my: လျှပ်စစ်စွမ်းအားအင်ဂျင်နီယာဌာန

source: This department specializes in power generation, transmission, and distribution. Students learn to work with electrical systems and emerging technologies in sustainable energy and smart grids.
my: လျှပ်စစ်စွမ်းအားအင်ဂျင်နီယာဌာနသည် စွမ်းအင်ထုတ်လုပ်ခြင်း၊ လွှဲပြောင်းခြင်းနှင့် ဖြန့်ဝေခြင်းနယ်ပယ်များတွင် ကျွမ်းကျင်သူများဖြစ်လာစေရန်ကျောင်းသားများအား တိုးတက်လာသည့် နည်းပညာများ၊စွမ်းအင်များနှင့်အတူ လေ့ကျင့်သင်ကြားပေးသည်

source: Power Systems
my: စွမ်းအင်စနစ်များ

source: Renewable Energy
my: အသစ်တဖန်ပြန်လည်အသုံးပြုနိုင်သောစွမ်းအင်

source: Electrical Machines
my: လျှပ်စစ်ဆိုင်ရာ စက်ပစ္စည်းများ

source: Power Electronics
my: စွမ်းအင်အီလက်ထရွန်နစ်

source: Electronics Engineering Department
my: အီလက်ထရွန်နစ်အင်ဂျင်နီယာဌာန

source: Electronics Engineering equips students with the knowledge to develop and maintain modern electronic systems. Focus areas include microelectronics, signal processing, and embedded systems.
my: အီလက်ထရွန်နစ်အင်ဂျင်နီယာဌာနသည် ခေတ်သစ်အီလက်ထရွန်နစ်စနစ်များဖန်တီးနိုင်ရန်နှင့် ပြုပြင်ထိန်းသိမ်းနိုင်ရန်အတွက် ကျောင်းသားများအားသိပ္ပံနည်းကျသင်ကြားပေးသည်။ မိုက်ခရိုအီလက်ထရွန်နစ်၊ ဆစ်ဂနယ်လုပ်ငန်းစဉ်များနှင့် စက်တွင်းမြှုပ်နံထားသောစနစ်များကို အဓိကထား သင်ကြားပေးပါသည်

source: Welcome to MTU
my: MTU မှကြိုဆိုပါသည်

source: Leading Innovation and Excellence in Myanmar
my: မြန်မာနိုင်ငံတွင် တီထွင်ဆန်းသစ်မှုနှင့် ထူးချွန်မှုကို ဦးဆောင်ထားခြင်း

source: Explore Programs
my: သင်တန်းအစီအစဉ်များလေ့လာရန်

source: Explore academic divisions leading innovation in science and engineering.
my: သိပ္ပံနှင့်အင်ဂျင်နီယာနယ်ပယ်၌ ဆန်းသစ်တီထွင်သော ပညာရေးများကို လေ့လာပါ

source: Explore
my: အသေးစိတ်လေ့လာရန်

source: News
my: သတင်းများ

source: Stay current with campus updates, research highlights, and student achievements.
my: လတ်တလော တက္ကသိုလ်တွင်းသတင်းများ၊ အထူးသုတေသနများနှင့် ကျောင်းသားများ၏ အောင်မြင်မှုမှတ်တိုင်များကို ကြည့်ရှုပါ

source: Stay Updated
my: ကြည့်ရှုရန်

source: Events
my: ပွဲအစီအစဉ်များ

source: Join workshops, seminars, and events that enrich academic and campus life.
my: ပညာရေးနှင့် တက္ကသိုလ်ကျောင်းသားဘဝကို အထောက်အကူဖြစ်စေသော အလုပ်ရုံဆွေးနွေးပွဲများနှင့် ဟောပြောပွဲများတွင် ပါဝင်ပါ

source: Check events
my: ကြည့်ရှုရန်

source: From AI to sustainable energy — MTU leads in transformative research initiatives.
my: AI မှသည် တာရှည်ခံစွမ်းအင်အထိ — MTU သည် ပြောင်းလဲမှုဖန်တီးနိုင်သော သုတေသနလုပ်ငန်းများကို ဦးဆောင်လျက်ရှိသည်

source: View Projects
my: ပရောဂျက်များကြည့်ရှုရန်

source: Get AI-driven course suggestions aligned with your goals and strengths.
my: သင့်ရည်မှန်းချက်များ၊ အားသာချက်များနှင့် ကိုက်ညီသည့် ဘာသာရပ်များကို AI အသုံးပြု၍ အကြံပြုချက်ရယူပါ

source: View Courses
my: ဘာသာရပ်များကြည့်ရှုရန်

source: Find Courses
my: ဘာသာရပ်များကြည့်ရှုရန်

source: Predicted Grades
my: မျှော်မှန်းရမှတ်များ

source: Review AI-based academic performance forecasts and insights.
my: AI ကို အသုံးပြု၍ ပညာရေးရလဒ်ခန့်မှန်းချက်များကို ပြန်လည်သုံးသပ်ပါ

source: Analyze Performance
my: ရလဒ်များစစ်ဆေးရန်

source: Understand your questions with AI-powered semantic search for accurate results.
my: သင်မေးလိုသောမေးခွန်းများကို တိကျသေချာသောအဖြေများ ရရှိအောင် AI မှ ရှာဖွေဖြေကြားပေးနိုင်ပါသည်

source: Try Smart Search
my: စမ်းသပ်အသုံးပြုရန်

source: AI Chatbot
my: AI လက်ထောက်အကူ

source: Chat instantly with our AI assistant for help with admissions, programs, and more.
my: တက္ကသိုလ်ဝင်ခွင့်၊ ပညာသင်နှစ်များနှင့် အခြားအကြောင်းအရာများအတွက် AI အကူအညီဖြင့် လျင်မြန်စွာ မေးမြန်းနိုင်ပါသည်

source: Try Now
my: ယခုပဲစမ်းသုံးကြည့်ပါ

source: Try It
my: စမ်းအသုံးပြုရန်

source: Trending Skills
my: လတ်တလောစိတ်ဝင်စားမှုများနေသော ဘာသာရပ်များ

source: Popular Courses
my: လူရွေးချယ်မှုများသော ဘာသာရပ်များ

source: Introduction to AI
my: AI နည်းပညာမိတ်ဆက်

source: Learn the fundamentals of Artificial Intelligence and its real-world applications.
my: AI နည်းပညာ အခြေခံသဘောတရားများနှင့် လက်တွေ့ဘဝ၌ အသုံးချနည်းများကို သင်ယူပါ

source: Understand cloud technologies and infrastructure management.
my: Cloud နည်းပညာများနှင့် ၎င်း၏အခြေခံဖွဲ့စည်းစီမံခန့်ခွဲမှုများကို နားလည်ရန်

source: IoT for Engineers
my: အင်ဂျင်နီယာများအတွက် IoT

source: Explore the Internet of Things and how it's transforming modern engineering.
my: အင်တာနက်ဖြင့် ချိတ်ဆက်ထားသည့် ပစ္စည်းများ(IoT)နှင့် ယနေ့ခေတ် အင်ဂျင်နီယာနည်းပညာကို မည်သို့ ပြောင်းလဲနေသည်ကို လေ့လာပါ

source: ain insights into computer networks, protocols, routing, switching, and secure communication systems.
my: ကွန်ပျူတာကွန်ယက်များ၊ ပရိုတိုကောများ၊ လမ်းကြောင်းချမှတ်မှု၊ Switching နှင့် လုံခြုံသည့် ဆက်သွယ်ရေးစနစ်များအကြောင်း လေ့လာပါ

source: Understand threat analysis, cryptography, ethical hacking, and how to secure digital infrastructure.
my: အွန်လိုင်းခြိမ်းခြောက်မှုများ၊ Cryptography၊ Ethical Hacking နှင့် ဒီဂျစ်တယ်အခြေခံဖွဲ့စည်းမှုကို ကာကွယ်နိုင်မည့်နည်းလမ်းများကို လေ့လာပါ

source: Mandalay Technological University (MTU) is one of the most prestigious engineering universities in Myanmar, committed to academic excellence, cutting-edge research, and innovative teaching. With a rich history and state-of-the-art facilities, MTU fosters a vibrant learning environment that empowers students to become future-ready engineers, scientists, and leaders.
my: မန္တလေးနည်းပညာတက္ကသိုလ် (MTU) သည် မြန်မာနိုင်ငံအတွင်း ထင်ရှားကြီးကျယ်သော အင်ဂျင်နီယာတက္ကသိုလ်များထဲမှတစ်ခုဖြစ်ပြီး ပညာရေးအရထူးချွန်မှု၊ နည်းပညာအရခေတ်မှီသော သုတေသနနှင့် ဆန်းသစ်တီထွင်သော သင်ကြားမှုများရရှိစေရန် ရည်မှန်းသည်။MTU သည် သမိုင်းကြောင်းပေါကြွယ်ဝပြီး ခေတ်မီအဆင့်မြင့်အဆောက်အအုံများဖြင့် ကျောင်းသားများအားမျှော်မှန်းချက်မြင့်မားသည့် အင်ဂျင်နီယာ၊ သိပ္ပံပညာရှင်များ၊ ခေါင်းဆောင်များအဖြစ် ဖြစ်ထွန်းလာစေသော သင်ကြားရေးပတ်ဝန်းကျင်တစ်ခုကို တည်ဆောက်ပေးသည်

source: Library Resources | MTU
my: စာကြည့်တိုက်အရင်းအမြစ်များ | MTU

source: Library Resources
my: စာကြည့်တိုက်အရင်းအမြစ်များ

source: Search books...
my: စာအုပ်များရှာဖွေပါ…

source: Author
my: စာရေးဆရာအမည်

source: Student ID
my: ကျောင်းသားအမှတ်

source: Password
my: စကားဝှက်

source: Login
my: အကောင့်ဝင်မည်

source: Register instead?
my: အကောင့်အသစ်ဖွင့်ရန်လိုအပ်ပါသလား

source: © 2023 Mandalay Technological University
my: © ၂၀၂၃ မန္တလေးနည်းပညာတက္ကသိုလ် - မူပိုင်ခွင့်ရှိသည်။

source: Active News and Events
my: လတ်တလောသတင်းနှင့်ပွဲအစီအစဉ်များ

source: Read more
my: ဆက်လက်ဖတ်ရန်

source: Active until
my: သက်တမ်းကုန်မည်

source: No news or events at the moment.
my: လတ်တလောသတင်းနှင့်ပွဲအစီအစဉ်များမရှိပါ

source: Registration Page
my: ‌အကောင့်သစ်ဖွင့်ရန်စာမျက်နှာ

source: Create Account
my: အကောင့်အသစ်ဖွင့်ရန်

source: Must match your official university ID
my: တက္ကသိုလ်မှတ်ပုံတင်အမှတ်နှင့် ကိုက်ညီရမည်

source: At least 8 characters
my: အနည်းဆုံး အက္ခရာ ၈ လုံး

source: Confirm Password
my: စကားဝှက်အတည်ပြုရန်

source: Register
my: အကောင့်ဖွင့်ပါ

source: Login Here
my: ဤနေရာမှဝင်ပါ

source: RESEARCH
my: သုတေသနများ

source: Explore our latest university research and publications.
my: တက္ကသိုလ်မှနောက်ဆုံးထွက်ရှိသော သုတေသနများနှင့်ထုတ်ဝေစာတမ်းများကို ကြည့်ရှုပါ

source: Summarize your research documents here
my: သင်၏သုတေသနစာတမ်းများကို ဤနေရာတွင်အကျဉ်းချုပ် ကြည့်ရှုပါ

source: Search research...
my: သုတေသနများ ရှာဖွေရန်

source: View Document
my: စာတမ်းကြည့်ရန်

source: No research found.
my: ရှာဖွေသော သုတေသနစာတမ်းမတွေ့ရှိပါ

source: Try: "Project ideas"
my: ပရောဂျက် အိုင်ဒီယာများ စမ်းသပ်ကြည့်ရန်

source: Books
my: စာအုပ်များ

source: No books found.
my: ရှာဖွေသောစာအုပ်မတွေ့ရှိပါ

source: Courses
my: ဘာသာရပ်များ

source: No courses found.
my: ရှာဖွေသော ဘာသာရပ်မတွေ့ရှိပါ

source: News Articles
my: သတင်းဆောင်းပါးများ

source: No news articles found.
my: ရှာဖွေသော သတင်းဆောင်းပါးမတွေ့ရှိပါ

source: No research papers found.
my: ရှာဖွေသောသုတေသနစာတမ်းများမတွေ့ရှိပါ

source: Additional Resources
my: ထပ်ဆောင်းအရင်းအမြစ်များ

source: Academic Records for %(student_name)s
my: %(student_name)s ၏ပညာရေးမှတ်တမ်းများ

source: Subject
my: ဘာသာရပ်

source: Code
my: ဘာသာရပ်ဆိုင်ရာကုဒ်

source: Attendance
my: ကျောင်းတက်ရောက်မှုမှတ်တမ်း

source: Assignments
my: သင်ကြားမှုမှတ်တမ်းများ

source: Final
my: ဒုတိယနှစ်ဝက်ရမှတ်

source: Total
my: စုစုပေါင်းရမှတ်

source: Generate Grade Prediction
my: ခန့်မှန်းအမှတ်ထုတ်ပါ
